In [1]:
# Week 1 Notebook: Data Understanding & Import

import pandas as pd
import numpy as np

In [2]:
# Load dataset
df = pd.read_csv("StudentsPerformance.csv")

# Display first few rows
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [3]:
# Dataset shape
df.shape

(1000, 8)

In [4]:
# Column names
df.columns.tolist()

['gender',
 'race/ethnicity',
 'parental level of education',
 'lunch',
 'test preparation course',
 'math score',
 'reading score',
 'writing score']

In [5]:
# Dataset info: types, non-null counts
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [6]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [7]:
df.describe(include='object')

,gender,race/ethnicity,parental level of education,lunch,test preparation course
count,1000,1000,1000,1000,1000
unique,2,5,6,2,2
top,female,group C,some college,standard,none
freq,518,319,226,645,642

In [8]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [9]:
data_types = pd.DataFrame({
    'Column': df.columns,
    'Data_Type': df.dtypes.astype(str)
})
data_types

                                                  Column Data_Type
gender                                            gender    object
race/ethnicity                            race/ethnicity    object
parental level of education  parental level of education    object
lunch                                              lunch    object
test preparation course          test preparation course    object
math score                                    math score     int64
reading score                              reading score     int64
writing score                              writing score     int64

In [10]:
# Mapping pandas dtypes to MySQL types
dtype_mapping = {
    'int64': 'INT',
    'float64': 'FLOAT',
    'object': 'VARCHAR(255)'
}

sql_fields = []

for col, dtype in df.dtypes.items():
    mysql_type = dtype_mapping.get(str(dtype), 'VARCHAR(255)')
    sql_fields.append(f"`{col}` {mysql_type}")

sql_table = "CREATE TABLE StudentsPerformance (\n" + ",\n".join(sql_fields) + "\n);"

print(sql_table)

CREATE TABLE StudentsPerformance (
`gender` VARCHAR(255),
`race/ethnicity` VARCHAR(255),
`parental level of education` VARCHAR(255),
`lunch` VARCHAR(255),
`test preparation course` VARCHAR(255),
`math score` INT,
`reading score` INT,
`writing score` INT
);

In [11]:
df.to_csv("StudentsPerformance_clean.csv", index=False)
print("Export completed: StudentsPerformance_clean.csv")

Export completed: StudentsPerformance_clean.csv